index.org
#+options: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline author:t
#+options: broken-links:nil c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+options: email:nil expand-links:t f:t inline:t num:t p:nil pri:nil prop:nil
#+options: stat:t tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+title: index
#+date: <2026-05-10 Sun>
#+author: Kristian Alexander P
#+email: alexforsale@yahoo.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 30.2 (Org mode 9.8.4)
#+cite_export:
#+setupfile: https://fniessen.github.io/org-html-themes/org/html-theme-readtheorg.setup
#+export_file_name: index.html

* Xorg startup files
** .xprofile
:PROPERTIES:
:header-args: :tangle .xprofile :shebang #!/bin/sh
:END:
This file (and also =/etc/xprofile= if exists) will be executed at the beginning of X user session, before the window manager starts.
#+begin_src shell
  # ~/.xprofile
  # user X session startup file.
  # <alexforsale@yahoo.com>

  if [ -d "${HOME}/.config/xprofile.d" ]; then
      for xfiles in "${HOME}"/.config/xprofile.d/*.sh; do
          # shellcheck disable=1090
          . "${xfiles}"
      done
      unset xfiles
  fi

  # set XDG_SESSION_TYPE here making sure it's points to x11
  if [ -n "${XDG_SESSION_TYPE}" ] || [ "${XDG_SESSION_TYPE}" != "x11" ]; then
      export XDG_SESSION_TYPE="x11"
  fi

  # shellcheck disable=1091
  [ -f "${XDG_CONFIG_HOME}"/xprofile.local ] && . "${XDG_CONFIG_HOME}"/xprofile.local
  # shellcheck disable=1091
  [ -f "${HOME}"/.xprofile.local ] && . "${HOME}"/.xprofile.local
#+end_src
*** Modules
**** 00-security.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/00-security.sh :shebang #!/bin/sh :mkdirp t
:END:
#+begin_src shell
# various ui-related security settings
# <alexforsale@yahoo.com>

if [ -f /usr/bin/x11-ssh-askpass ]; then
    export SSH_ASKPASS=/usr/bin/x11-ssh-askpass
    export SUDO_ASKPASS=/usr/bin/x11-ssh-askpass
elif [ -f /usr/lib/ssh/x11-ssh-askpass ]; then
    [ ! -L ~/.local/bin/ssh-askpass ] &&
        ln -sf /usr/lib/ssh/x11-ssh-askpass ~/.local/bin/ssh-askpass
    export SSH_ASKPASS=ssh-askpass
    export SUDO_ASKPASS="${HOME}"/.local/bin/ssh-askpass
elif [ -f /usr/local/bin/x11-ssh-askpass ]; then
    export SSH_ASKPASS=/usr/local/bin/x11-ssh-askpass
    export SUDO_ASKPASS=/usr/local/bin/x11-ssh-askpass
fi
#+end_src
**** 01-xdg-desktop-portal.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/01-xdg-desktop-portal.sh :shebang #!/bin/sh :mkdirp t
:END:
#+begin_src shell
# xdg-desktop-portal settings
# <alexforsale@yahoo.com>

if [ -z "${XDG_CURRENT_DESKTOP}" ]; then
    if [ -n "${DESKTOP_SESSION}" ]; then
        export XDG_CURRENT_DESKTOP="${DESKTOP_SESSION}"
    elif [ -n "${GDMSESSION}" ]; then
        export XDG_CURRENT_DESKTOP="${GDMSESSION}"
    elif [ -n "${XDG_SESSION_DESKTOP}" ]; then
        export XDG_CURRENT_DESKTOP="${XDG_SESSION_DESKTOP}"
    fi
fi
#+end_src
**** 10-numlockx.sh
:PROPERTIES:
:header-args: :tangle .config/xprofile.d/10-numlockx.sh :shebang #!/bin/sh :mkdirp t
:END:

#+begin_src shell
# ~/.config/xprofile.d/10-numlockx.sh
# <alexforsale@yahoo.com>
[ "$(command -v numlockx)" ] && numlockx
#+end_src
** Xresources
*** .Xresources
:PROPERTIES:
:header-args: :tangle .Xresources
:END:

#+begin_src conf-xdefaults
#include ".config/Xresources.d/xterm"
#include ".config/Xresources.d/URxvt"
#include ".config/Xresources.d/colors"

! cursor theme
Xcursor.theme: catppuccin-mocha-light-cursors
Xcursor.size: 24
Xft.autohint: 0
Xft.hinting: 1
Xft.hintstyle: hintmedium
Xft.antialias: 1
Xft.rgba: rgb
#+end_src
**** modules
***** xterm
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/xterm :mkdirp t
:END:

#+begin_src conf-xdefaults
xterm*termName: xterm-256color
xterm.vt100.geometry: 80x24
xterm*saveLines: 4096
xterm*scrollBar: False
xterm*.LoginShell: True
xterm*rightScrollBar: False
xterm*scrollTtyOutput: False
xterm.selectToClipboard: true
xterm.*backarrowKey: false
xterm*translations: #override \
Ctrl Shift <KeyPress> C: copy-selection(CLIPBOARD) \n\
Ctrl Shift <KeyPress> V: insert-selection(CLIPBOARD) \n\
Ctrl <Btn1Up>: exec-formatted("xdg-open '%t'", PRIMARY) \n\
~Meta Shift<Key>Tab: string(\033[Z) \n\
Meta Shift<Key>Tab: string(\033\033[Z) \n\
Ctrl <Key> minus: smaller-vt-font() \n\
Ctrl <Key> plus: larger-vt-font() \n\
Ctrl <Key> 0: set-vt-font(d)
xterm*eightBitInput: false
xterm*metaSendsEscape: true
xterm*charClass: 33:48,37-38:48,45-47:48,64:48,58:48,126:48,61:48,63:48,43:48,35:48
xterm*renderFont: true
xterm*faceName: OverpassM Nerd Font Mono
xterm*faceSize: 10
#+end_src
***** URxvt
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/URxvt :mkdirp t
:END:

#+begin_src conf-xdefaults
! arch package (aur): urxvt-resize-font-git
URxvt.perl-ext-common: default,tabbed,matcher,resize-font,-tabbed
URxvt.saveLines: 2000
URxvt.secondaryScreen: 1
URxvt.secondaryScroll: 0
URxvt.scrollBar: False
URxvt.scrollBar_right: false
URxvt.scrollBar_floating: false
URxvt.scrollstyle: rxvt
URxvt.termName: xterm-256color
URxvt.cursorBlink: True
URxvt.secondaryWheel: 1
URxvt.font: xft:Source\ Code\ Pro:size=8
URxvt.keysym.C-S-0x43: eval:selection_to_clipboard
URxvt.keysym.C-S-0x56: eval:paste_clipboard
URxvt.keysym.C-minus: resize-font:smaller
URxvt.keysym.C-plus: resize-font:bigger
URxvt.keysym.C-equal: resize-font:reset
URxvt.keysym.C-question: resize-font:show
URxvt.iso14755: false
URxvt.iso14755_52: false
URxvt.bell-command: canberra-gtk-play -i bell
URxvt.loginShell: true
#+end_src
***** colors
:PROPERTIES:
:header-args: :tangle .config/Xresources.d/colors :mkdirp t
:END:

#+begin_src conf-xdefaults
! -*- eval: (rainbow-mode +1) -*-
,*background: #1e1e2e
,*foreground: #cdd6f4
,*cursorColor: #f5e0dc

! black
,*color0: #45475a
,*color8: #585b70

! red
,*color1: #f38ba8
,*color9: #f38ba8

! green
,*color2: #a6e3a1
,*color10: #a6e3a1

! yellow
,*color3: #f9e2af
,*color11: #f9e2af

! blue
,*color4: #89b4fa
,*color12: #89b4fa

! magenta
,*color5: #f5c2e7
,*color13: #f5c2e7

! cyan
,*color6: #94e2d5
,*color14: #94e2d5

! white
,*color7: #bac2de
,*color15: #a6adc8
#+end_src
