index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-11 Mon 12:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>index</title>
<meta name="author" content="Kristian Alexander P" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/code-copy.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">index</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org739ac6f">Xorg startup files</a>
<ul>
<li><a href="#org2f59b22">.xprofile</a>
<ul>
<li><a href="#orgcb82fea">Modules</a>
<ul>
<li><a href="#org99c30f3">00-security.sh</a></li>
<li><a href="#org8c182bb">01-xdg-desktop-portal.sh</a></li>
<li><a href="#org2955e28">10-numlockx.sh</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org22d3fd1">Xresources</a>
<ul>
<li><a href="#org26dbf01">.Xresources</a>
<ul>
<li><a href="#org9d47985">modules</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org739ac6f" class="outline-2">
<h2 id="org739ac6f">Xorg startup files</h2>
<div class="outline-text-2" id="text-org739ac6f">
</div>
<div id="outline-container-org2f59b22" class="outline-3">
<h3 id="org2f59b22">.xprofile</h3>
<div class="outline-text-3" id="text-org2f59b22">
<p>
This file (and also <code>/etc/xprofile</code> if exists) will be executed at the beginning of X user session, before the window manager starts.
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.xprofile
</span><span style="color: #b22222;"># </span><span style="color: #b22222;">user X session startup file.
</span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>
<span style="color: #4169e1;">if</span> [ -d <span style="color: #bc8f8f;">"${HOME}/.config/xprofile.d"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #4169e1;">for</span> xfiles<span style="color: #4169e1;"> in</span> <span style="color: #bc8f8f;">"${HOME}"</span>/.config/xprofile.d/*.sh; <span style="color: #4169e1;">do</span>
        <span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1090
</span>        <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${xfiles}"</span>
    <span style="color: #4169e1;">done</span>
    <span style="color: #00008b;">unset</span> xfiles
<span style="color: #4169e1;">fi</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">set XDG_SESSION_TYPE here making sure it's points to x11
</span><span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${XDG_SESSION_TYPE}"</span> ] || [ <span style="color: #bc8f8f;">"${XDG_SESSION_TYPE}"</span> != <span style="color: #bc8f8f;">"x11"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_SESSION_TYPE</span>=<span style="color: #bc8f8f;">"x11"</span>
<span style="color: #4169e1;">fi</span>

<span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1091
</span>[ -f <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/xprofile.local ] &amp;&amp; <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${XDG_CONFIG_HOME}"</span>/xprofile.local
<span style="color: #b22222;"># </span><span style="color: #b22222;">shellcheck disable=1091
</span>[ -f <span style="color: #bc8f8f;">"${HOME}"</span>/.xprofile.local ] &amp;&amp; <span style="color: #00008b;">.</span> <span style="color: #bc8f8f;">"${HOME}"</span>/.xprofile.local
</pre>
</div>
</div>
<div id="outline-container-orgcb82fea" class="outline-4">
<h4 id="orgcb82fea">Modules</h4>
<div class="outline-text-4" id="text-orgcb82fea">
</div>
<div id="outline-container-org99c30f3" class="outline-5">
<h5 id="org99c30f3">00-security.sh</h5>
<div class="outline-text-5" id="text-org99c30f3">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">various ui-related security settings
</span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>
<span style="color: #4169e1;">if</span> [ -f /usr/bin/x11-ssh-askpass ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=/usr/bin/x11-ssh-askpass
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=/usr/bin/x11-ssh-askpass
<span style="color: #4169e1;">elif</span> [ -f /usr/lib/ssh/x11-ssh-askpass ]; <span style="color: #4169e1;">then</span>
    [ ! -L ~/.local/bin/ssh-askpass ] &amp;&amp;
        ln -sf /usr/lib/ssh/x11-ssh-askpass ~/.local/bin/ssh-askpass
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=ssh-askpass
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=<span style="color: #bc8f8f;">"${HOME}"</span>/.local/bin/ssh-askpass
<span style="color: #4169e1;">elif</span> [ -f /usr/local/bin/x11-ssh-askpass ]; <span style="color: #4169e1;">then</span>
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SSH_ASKPASS</span>=/usr/local/bin/x11-ssh-askpass
    <span style="color: #00008b;">export</span> <span style="color: #b8860b;">SUDO_ASKPASS</span>=/usr/local/bin/x11-ssh-askpass
<span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8c182bb" class="outline-5">
<h5 id="org8c182bb">01-xdg-desktop-portal.sh</h5>
<div class="outline-text-5" id="text-org8c182bb">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">xdg-desktop-portal settings
</span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>
<span style="color: #4169e1;">if</span> [ -z <span style="color: #bc8f8f;">"${XDG_CURRENT_DESKTOP}"</span> ]; <span style="color: #4169e1;">then</span>
    <span style="color: #4169e1;">if</span> [ -n <span style="color: #bc8f8f;">"${DESKTOP_SESSION}"</span> ]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_CURRENT_DESKTOP</span>=<span style="color: #bc8f8f;">"${DESKTOP_SESSION}"</span>
    <span style="color: #4169e1;">elif</span> [ -n <span style="color: #bc8f8f;">"${GDMSESSION}"</span> ]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_CURRENT_DESKTOP</span>=<span style="color: #bc8f8f;">"${GDMSESSION}"</span>
    <span style="color: #4169e1;">elif</span> [ -n <span style="color: #bc8f8f;">"${XDG_SESSION_DESKTOP}"</span> ]; <span style="color: #4169e1;">then</span>
        <span style="color: #00008b;">export</span> <span style="color: #b8860b;">XDG_CURRENT_DESKTOP</span>=<span style="color: #bc8f8f;">"${XDG_SESSION_DESKTOP}"</span>
    <span style="color: #4169e1;">fi</span>
<span style="color: #4169e1;">fi</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2955e28" class="outline-5">
<h5 id="org2955e28">10-numlockx.sh</h5>
<div class="outline-text-5" id="text-org2955e28">
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #b22222;"># </span><span style="color: #b22222;">~/.config/xprofile.d/10-numlockx.sh
</span><span style="color: #b22222;"># </span><span style="color: #b22222;"><a href="mailto:alexforsale%40yahoo.com">&lt;alexforsale@yahoo.com&gt;</a>
</span>[ <span style="color: #bc8f8f;">"$(</span><span style="font-weight: bold;">command -v numlockx</span><span style="color: #bc8f8f;">)"</span> ] &amp;&amp; numlockx
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org22d3fd1" class="outline-3">
<h3 id="org22d3fd1">Xresources</h3>
<div class="outline-text-3" id="text-org22d3fd1">
</div>
<div id="outline-container-org26dbf01" class="outline-4">
<h4 id="org26dbf01">.Xresources</h4>
<div class="outline-text-4" id="text-org26dbf01">
<div class="org-src-container">
<pre class="src src-conf-xdefaults">#include <span style="color: #bc8f8f;">".config/Xresources.d/xterm"</span>
#include <span style="color: #bc8f8f;">".config/Xresources.d/URxvt"</span>
#include <span style="color: #bc8f8f;">".config/Xresources.d/colors"</span>

<span style="color: #b22222;">! </span><span style="color: #b22222;">cursor theme
</span><span style="color: #b8860b;">Xcursor.theme</span>: catppuccin-mocha-light-cursors
<span style="color: #b8860b;">Xcursor.size</span>: 24
<span style="color: #b8860b;">Xft.autohint</span>: 0
<span style="color: #b8860b;">Xft.hinting</span>: 1
<span style="color: #b8860b;">Xft.hintstyle</span>: hintmedium
<span style="color: #b8860b;">Xft.antialias</span>: 1
<span style="color: #b8860b;">Xft.rgba</span>: rgb
</pre>
</div>
</div>
<div id="outline-container-org9d47985" class="outline-5">
<h5 id="org9d47985">modules</h5>
<div class="outline-text-5" id="text-org9d47985">
</div>
<ul class="org-ul">
<li><a id="orgf05a0fa"></a>xterm<br />
<div class="outline-text-6" id="text-orgf05a0fa">
<div class="org-src-container">
<pre class="src src-conf-xdefaults"><span style="color: #b8860b;">xterm*termName</span>: xterm-256color
<span style="color: #b8860b;">xterm.vt100.geometry</span>: 80x24
<span style="color: #b8860b;">xterm*saveLines</span>: 4096
<span style="color: #b8860b;">xterm*scrollBar</span>: False
<span style="color: #b8860b;">xterm*.LoginShell</span>: True
<span style="color: #b8860b;">xterm*rightScrollBar</span>: False
<span style="color: #b8860b;">xterm*scrollTtyOutput</span>: False
<span style="color: #b8860b;">xterm.selectToClipboard</span>: true
<span style="color: #b8860b;">xterm.*backarrowKey</span>: false
<span style="color: #b8860b;">xterm*translations</span>: #override \
<span style="color: #b8860b;">Ctrl Shift &lt;KeyPress&gt; C</span>: copy-selection(CLIPBOARD) \n\
<span style="color: #b8860b;">Ctrl Shift &lt;KeyPress&gt; V</span>: insert-selection(CLIPBOARD) \n\
<span style="color: #b8860b;">Ctrl &lt;Btn1Up&gt;</span>: exec-formatted(<span style="color: #bc8f8f;">"xdg-open '%t'"</span>, PRIMARY) \n\
<span style="color: #b8860b;">~Meta Shift&lt;Key&gt;Tab</span>: string(\033[Z) \n\
<span style="color: #b8860b;">Meta Shift&lt;Key&gt;Tab</span>: string(\033\033[Z) \n\
<span style="color: #b8860b;">Ctrl &lt;Key&gt; minus</span>: smaller-vt-font() \n\
<span style="color: #b8860b;">Ctrl &lt;Key&gt; plus</span>: larger-vt-font() \n\
<span style="color: #b8860b;">Ctrl &lt;Key&gt; 0</span>: set-vt-font(d)
<span style="color: #b8860b;">xterm*eightBitInput</span>: false
<span style="color: #b8860b;">xterm*metaSendsEscape</span>: true
<span style="color: #b8860b;">xterm*charClass</span>: 33:48,37-38:48,45-47:48,64:48,58:48,126:48,61:48,63:48,43:48,35:48
<span style="color: #b8860b;">xterm*renderFont</span>: true
<span style="color: #b8860b;">xterm*faceName</span>: OverpassM Nerd Font Mono
<span style="color: #b8860b;">xterm*faceSize</span>: 10
</pre>
</div>
</div>
</li>
<li><a id="orgd1b3a0e"></a>URxvt<br />
<div class="outline-text-6" id="text-orgd1b3a0e">
<div class="org-src-container">
<pre class="src src-conf-xdefaults"><span style="color: #b22222;">! </span><span style="color: #b22222;">arch package (aur): urxvt-resize-font-git
</span><span style="color: #b8860b;">URxvt.perl-ext-common</span>: default,tabbed,matcher,resize-font,-tabbed
<span style="color: #b8860b;">URxvt.saveLines</span>: 2000
<span style="color: #b8860b;">URxvt.secondaryScreen</span>: 1
<span style="color: #b8860b;">URxvt.secondaryScroll</span>: 0
<span style="color: #b8860b;">URxvt.scrollBar</span>: False
<span style="color: #b8860b;">URxvt.scrollBar_right</span>: false
<span style="color: #b8860b;">URxvt.scrollBar_floating</span>: false
<span style="color: #b8860b;">URxvt.scrollstyle</span>: rxvt
<span style="color: #b8860b;">URxvt.termName</span>: xterm-256color
<span style="color: #b8860b;">URxvt.cursorBlink</span>: True
<span style="color: #b8860b;">URxvt.secondaryWheel</span>: 1
<span style="color: #b8860b;">URxvt.font</span>: xft:Source\ Code\ Pro:size=8
<span style="color: #b8860b;">URxvt.keysym.C-S-0x43</span>: eval:selection_to_clipboard
<span style="color: #b8860b;">URxvt.keysym.C-S-0x56</span>: eval:paste_clipboard
<span style="color: #b8860b;">URxvt.keysym.C-minus</span>: resize-font:smaller
<span style="color: #b8860b;">URxvt.keysym.C-plus</span>: resize-font:bigger
<span style="color: #b8860b;">URxvt.keysym.C-equal</span>: resize-font:reset
<span style="color: #b8860b;">URxvt.keysym.C-question</span>: resize-font:show
<span style="color: #b8860b;">URxvt.iso14755</span>: false
<span style="color: #b8860b;">URxvt.iso14755_52</span>: false
<span style="color: #b8860b;">URxvt.bell-command</span>: canberra-gtk-play -i bell
<span style="color: #b8860b;">URxvt.loginShell</span>: true
</pre>
</div>
</div>
</li>
<li><a id="org6b7d6b5"></a>colors<br />
<div class="outline-text-6" id="text-org6b7d6b5">
<div class="org-src-container">
<pre class="src src-conf-xdefaults"><span style="color: #b22222;">! </span><span style="color: #b22222;">-*- eval: (rainbow-mode +1) -*-
</span><span style="color: #b8860b;">*background</span>: #1e1e2e
<span style="color: #b8860b;">*foreground</span>: #cdd6f4
<span style="color: #b8860b;">*cursorColor</span>: #f5e0dc

<span style="color: #b22222;">! </span><span style="color: #b22222;">black
</span><span style="color: #b8860b;">*color0</span>: #45475a
<span style="color: #b8860b;">*color8</span>: #585b70

<span style="color: #b22222;">! </span><span style="color: #b22222;">red
</span><span style="color: #b8860b;">*color1</span>: #f38ba8
<span style="color: #b8860b;">*color9</span>: #f38ba8

<span style="color: #b22222;">! </span><span style="color: #b22222;">green
</span><span style="color: #b8860b;">*color2</span>: #a6e3a1
<span style="color: #b8860b;">*color10</span>: #a6e3a1

<span style="color: #b22222;">! </span><span style="color: #b22222;">yellow
</span><span style="color: #b8860b;">*color3</span>: #f9e2af
<span style="color: #b8860b;">*color11</span>: #f9e2af

<span style="color: #b22222;">! </span><span style="color: #b22222;">blue
</span><span style="color: #b8860b;">*color4</span>: #89b4fa
<span style="color: #b8860b;">*color12</span>: #89b4fa

<span style="color: #b22222;">! </span><span style="color: #b22222;">magenta
</span><span style="color: #b8860b;">*color5</span>: #f5c2e7
<span style="color: #b8860b;">*color13</span>: #f5c2e7

<span style="color: #b22222;">! </span><span style="color: #b22222;">cyan
</span><span style="color: #b8860b;">*color6</span>: #94e2d5
<span style="color: #b8860b;">*color14</span>: #94e2d5

<span style="color: #b22222;">! </span><span style="color: #b22222;">white
</span><span style="color: #b8860b;">*color7</span>: #bac2de
<span style="color: #b8860b;">*color15</span>: #a6adc8
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-05-10 Sun 00:00</p>
<p class="author">Author: Kristian Alexander P</p>
<p class="date">Created: 2026-05-11 Mon 12:15</p>
</div>
</body>
</html>
